{
  "title": "Beyond the Chat: Interaction, Verification and Auditing Tools To Improve Transparency and Accuracy when Editing Text with an LLM",
  "block-id": "1743122670",
  "summary": "This is a paper created automatically",
  "intent": "To provide a starting point for writing",
  "type": "paper",
  "content": [
    {
      "title": "Main Content",
      "block-id": "1743122670",
      "summary": "",
      "intent": "",
      "type": "section",
      "content": [
        {
          "block-id": "1743122676",
          "summary": "",
          "intent": "",
          "type": "paragraph",
          "content": [
            {
              "block-id": "1743122671",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "Conversational interfaces powered by Large Language Models (LLMs) have recently become a popular way to obtain feedback during document editing."
            },
            {
              "block-id": "1743122672",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "However, standard chat-based conversational interfaces do not support transparency and verifiability of the editing changes that they suggest."
            },
            {
              "block-id": "1743122673",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "To give the author more agency when editing with an LLM, we present InkSync, an editing interface that suggests executable edits directly within the document being edited."
            },
            {
              "block-id": "1743122674",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "Because LLMs are known to introduce factual errors, Inksync also supports a 3-stage approach to mitigate this risk: Warn authors when a suggested edit introduces new information, help authors Verify the new information's accuracy through external search, and allow an auditor to perform an a-posteriori verification by Auditing the document via a trace of all auto-generated content."
            },
            {
              "block-id": "1743122675",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "Two usability studies confirm the effectiveness of InkSync's components when compared to standard LLM-based chat interfaces, leading to more accurate, more efficient editing, and improved user experience."
            }
          ]
        }
      ]
    },
    {
      "title": "Introduction",
      "block-id": "1743122677",
      "summary": "",
      "intent": "",
      "type": "section",
      "content": [
        {
          "block-id": "1743122681",
          "summary": "",
          "intent": "",
          "type": "paragraph",
          "content": [
            {
              "block-id": "1743122678",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "For many years, authors have used computer-assisted editing tools to improve their writing, as seen in the grammar suggestions of commercial software like Microsoft Word, Google Docs, and Grammarly."
            },
            {
              "block-id": "1743122679",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "With the recent advances in Large Language Models (LLMs), the variety and power of automated suggestions for editing and rewriting has greatly increased."
            },
            {
              "block-id": "1743122680",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "LLMs can go beyond typo and grammar suggestions, providing the ability to improve or change the tone (e.g., ``make this more informal''), personalize the text for a target reader (e.g., ``rewrite for a family with two children''), and suggest new content (e.g., ``suggest attractions for the family to visit'')."
            }
          ]
        },
        {
          "block-id": "1743122684",
          "summary": "",
          "intent": "",
          "type": "paragraph",
          "content": [
            {
              "block-id": "1743122682",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "Editing is a popular use of LLM-based chatbots."
            },
            {
              "block-id": "1743122683",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "OpenAI's GPT3 API statistics  reveal that when breaking down use cases by task type, ``rewrite'' tasks make up 6.6\\% of all queries (even more than summarization queries at 4.2\\%), implying the popularity of LLM-based feedback when editing text documents."
            }
          ]
        },
        {
          "block-id": "1743122690",
          "summary": "",
          "intent": "",
          "type": "paragraph",
          "content": [
            {
              "block-id": "1743122685",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "Yet standard LLM conversational interaction interfaces such as the popular ChatGPT lack several desirable properties."
            },
            {
              "block-id": "1743122686",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "As illustrated in Figure~ (top), in a conversational interface, the LLM typically replies to a user's rewrite query with a fully revised draft."
            },
            {
              "block-id": "1743122687",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "This puts the burden on the author to mentally compare their draft and the LLM's proposed draft to assess changes."
            },
            {
              "block-id": "1743122688",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "Authors must either manually integrate the suggestions, or be tempted to use the entire LLM-generated revision."
            },
            {
              "block-id": "1743122689",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "We conducted a survey of professional workers (Section~) that found that 80\\% of respondents use chat-based LLMs for editing documents, and while most (86\\%) manually integrate the suggestions into their documents, 17\\% copy the new version of the document verbatim."
            }
          ]
        },
        {
          "block-id": "1743122695",
          "summary": "",
          "intent": "",
          "type": "paragraph",
          "content": [
            {
              "block-id": "1743122691",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "To remedy these limitations, we introduce a new tool called InkSync for incorporating LLM-generated suggestions into the editing process."
            },
            {
              "block-id": "1743122692",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "As shown in Figure~ (bottom), this tool introduces a novel editing workflow, allowing the author to clearly see which edits have been suggested in context, accept or reject those edits, view warnings about which suggested content contains new information, and scaffold the verification of that new information."
            },
            {
              "block-id": "1743122693",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "InkSync incorporates four LLM-based components (Chat, Comment, Markers, and Brainstorm; Section~) that can generate an explicit list of , which are displayed to the author directly within the text editing interface."
            },
            {
              "block-id": "1743122694",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "The author can then easily accept or dismiss the suggested edits based on their judgment and intended goals."
            }
          ]
        },
        {
          "block-id": "1743122697",
          "summary": "",
          "intent": "",
          "type": "paragraph",
          "content": [
            {
              "block-id": "1743122696",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "We conduct two empirical studies to assess the use of Inksync to produce better and more accurate text than a standard chat-based LLM alone."
            }
          ]
        },
        {
          "block-id": "1743122701",
          "summary": "",
          "intent": "",
          "type": "paragraph",
          "content": [
            {
              "block-id": "1743122698",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "In the first study (Section~), we explore the usability of the four edit-suggesting components and their relative effectiveness in helping participants achieve two objectives: (1) improving the tone and grammar of an email, and (2) customizing the email to a specific recipient."
            },
            {
              "block-id": "1743122699",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "Our findings reveal that participants using interfaces with these editing components are more successful at achieving both objectives than manual editing or a standard chat-based interface alone."
            },
            {
              "block-id": "1743122700",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "We also find that the LLM-enabled components can complement each other: participants using an interface with all four editing components were the most effective at accomplishing the editing objectives."
            }
          ]
        },
        {
          "block-id": "1743122705",
          "summary": "",
          "intent": "",
          "type": "paragraph",
          "content": [
            {
              "block-id": "1743122702",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "An important and well-known limitation of using LLM-generated content in practical applications is the absence of a factual accuracy guarantee, as LLMs are known to hallucinate (make up) facts ."
            },
            {
              "block-id": "1743122703",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "In an analysis conducted on 200 documents edited during the first study, we found that 28\\% of the documents contained minor factual errors, and 12\\% contained major factual errors, confirming that LLM's factual accuracy limitations extend to the domain of text editing."
            },
            {
              "block-id": "1743122704",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "To directly address the factual accuracy limitation of LLM-based interaction, we implement a three-stage approach in the InkSync interface: Warn, Verify, and Audit."
            }
          ]
        },
        {
          "block-id": "1743122710",
          "summary": "",
          "intent": "",
          "type": "paragraph",
          "content": [
            {
              "block-id": "1743122706",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "\\setlength"
            },
            {
              "block-id": "1743122707",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "•  The system shows the author a visual warning for suggested edits that would \\textit to the document,"
            },
            {
              "block-id": "1743122708",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "•  For edits that introduce new information, the author is given the option to accept, dismiss, or \\textit the edit, with a list of automatically-generated search engine queries to aid in verification."
            },
            {
              "block-id": "1743122709",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "An  can be used to trace all system-generated content present in the latest document version, allowing an auditor to verify the accuracy of any LLM suggestion in the product of the editing process."
            }
          ]
        },
        {
          "block-id": "1743122713",
          "summary": "",
          "intent": "",
          "type": "paragraph",
          "content": [
            {
              "block-id": "1743122711",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "In the second study (Section~), we focus on evaluating the Warn, Verify, and Audit components of InkSync."
            },
            {
              "block-id": "1743122712",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "Our findings indicate that a majority of participants find the warnings useful in deciding which edits to verify, that the verification procedure we propose helps reduce the number of inaccurate edits accepted into the document by 44\\%, and that the auditing stage can further help identify up to 73\\% of inaccurate edits, playing a complementary role to edit-time verification."
            }
          ]
        },
        {
          "block-id": "1743122718",
          "summary": "",
          "intent": "",
          "type": "paragraph",
          "content": [
            {
              "block-id": "1743122714",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "In summary, our contributions are the following:"
            },
            {
              "block-id": "1743122715",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "• We design and implement the InkSync system, a text editing interface backed by four LLM-based components -- Markers, Chat, Comment, and Brainstorm -- that suggest executable edits to the user, providing transparent changes and enabling traceability of LLM content during the editing process,"
            },
            {
              "block-id": "1743122716",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "• We design and implement a three-stage Warn, Verify, and Audit approach to empower the user to know when the system is at risk of introducing factually inaccurate content, and to aid the user in verifying and auditing LLM content either at edit time or in a later audit,"
            },
            {
              "block-id": "1743122717",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "• We conduct two usability studies that experimentally validate the effectiveness of the InkSync system for the task of editing and customizing outreach emails, and that the Warn, Verify and Audit approach is an effective human-in-the-loop method to allow for advanced LLM-based text editing while mitigating the risk of introducing factually inaccurate content."
            }
          ]
        },
        {
          "block-id": "1743122720",
          "summary": "",
          "intent": "",
          "type": "paragraph",
          "content": [
            {
              "block-id": "1743122719",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "We plan to open-source the InkSync system -- which is LLM agnostic -- and the corpus of edited documents from our usability studies, to enable research on the future of LLM-based text editing interfaces."
            }
          ]
        }
      ]
    },
    {
      "title": "Related Work",
      "block-id": "1743122721",
      "summary": "",
      "intent": "",
      "type": "section",
      "content": [
        {
          "title": "Intelligent Text-Editing Interfaces",
          "block-id": "1743122722",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743122725",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122723",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Before LLMs, prior work looked at crowd workers as a source of intelligence to assist in writing tasks, with systems such as Soylent , MicroWriter , and WearWrite  designing various crowd-source editing interfaces, with key considerations for task decomposition, cost, and latency."
                },
                {
                  "block-id": "1743122724",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Since then, recent work has drawn a parallel between LLMs and crowdwork pipelines ."
                }
              ]
            },
            {
              "block-id": "1743122732",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122726",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Different suggestion mechanisms were proposed in prior work on co-writing with a model."
                },
                {
                  "block-id": "1743122727",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Most commonly, the model is used for text-completion (i.e., auto-complete) , which is compatible with the model's training objective ."
                },
                {
                  "block-id": "1743122728",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Yet auto-complete has drawbacks: it leads to reduced perceived authorship in the user , and better language modeling performance is not indicative of successful human-LM interaction ."
                },
                {
                  "block-id": "1743122729",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Some other work has proposed other mechanisms such as infilling  (i.e., leaving a blank in the document, which the model fills in), generic paraphrasing functions , or systems that provide high-level feedback in the form of questions to the author, but no executable suggestions ."
                },
                {
                  "block-id": "1743122730",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In InkSync, we implemented four edit-suggesting components that share a common executable edit language."
                },
                {
                  "block-id": "1743122731",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The components each provide interactions beyond auto-complete or infilling."
                }
              ]
            }
          ]
        },
        {
          "title": "Evaluation Tasks for Text Editing",
          "block-id": "1743122733",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743122742",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122734",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Prior work has explored a diverse set of tasks to evaluate intelligent text-editing interfaces."
                },
                {
                  "block-id": "1743122735",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Most commonly, studies have been designed on creative tasks like short-story writing , poetry , slogans , or screenplays ."
                },
                {
                  "block-id": "1743122736",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In such tasks, a central consideration is the model's impact on creativity, which is challenging to evaluate."
                },
                {
                  "block-id": "1743122737",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Recent work has proposed expository writing -- in which an author reviews a document corpus, synthesizes it, and adds their interpretation -- as a conducive task in the evaluation of AI-assisted writing support tools ."
                },
                {
                  "block-id": "1743122738",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In expository writing tasks, the system requirements might go beyond standard editing suggestions, with the system potentially providing inspiration , retrieving documents , and organizing the content hierarchically , which adds complexity to the evaluated system."
                },
                {
                  "block-id": "1743122739",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In our work, we focus on the task of customizing a sales email, for several reasons."
                },
                {
                  "block-id": "1743122740",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "First, the knowledge workers we recruit as participants report that they frequently write and edit emails."
                },
                {
                  "block-id": "1743122741",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Second, the task requires creativity from the participants, who can rely on the system for specific suggestions while allowing us to set a quantitative evaluation to measure participant success."
                }
              ]
            }
          ]
        },
        {
          "title": "Ethical Considerations of Co-writing",
          "block-id": "1743122743",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743122749",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122744",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Some prior work has discussed the ethical considerations of co-writing with a system, with issues of user control, authorship, or leadership ."
                },
                {
                  "block-id": "1743122745",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "find that a communicative agent leads to an improved collaborative experience (which we implement in the Chat and Comment InkSync components)."
                },
                {
                  "block-id": "1743122746",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "discuss the need for professional authors to retain control over their writing process, and  discuss an AI Ghostwriter effect: although human writers do not claim ownership of system-generated content, they are reluctant to publicly declare AI authorship."
                },
                {
                  "block-id": "1743122747",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Finally,  found that auto-complete reduces the sense of ownership compared to suggestion-based designs."
                },
                {
                  "block-id": "1743122748",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In InkSync, the executable nature of system suggestions gives editing control to the author and automatic traceability of system-generated text provides the auditing tools facilitating discussions of ownership and authorship."
                }
              ]
            }
          ]
        },
        {
          "title": "Text Editing in NLP",
          "block-id": "1743122750",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743122755",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122751",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Previous NLP work on text editing focuses on various text editing formulations tasks, such as news or Wikipedia simplification , biased text neutralization , or sentence decontextualization ."
                },
                {
                  "block-id": "1743122752",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Some work has framed text editing as an iterative process  and collected datasets of multi-turn interaction such as IteraTER  or Coauthor ."
                },
                {
                  "block-id": "1743122753",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In turn, prior work has proposed specialized models including PEER  and CoEdIT  that can provide iterative suggestions to a user."
                },
                {
                  "block-id": "1743122754",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In InkSync, we adapt an LLM to dynamically and iteratively suggest executable edits."
                }
              ]
            },
            {
              "block-id": "1743122760",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122756",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "NLP evaluation largely uses automatic metrics to measure system success, including n-gram metrics such as BLEU  or SARI , or more advanced learned metrics such as LENS ."
                },
                {
                  "block-id": "1743122757",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "While much work focuses on English, recent work includes multi-lingual benchmarks ."
                },
                {
                  "block-id": "1743122758",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Some work investigates human evaluation of text-editing models, usually via intrinsic evaluation using scoring scales , or ranking  to judge the success of the edited text in achieving a desired objective ."
                },
                {
                  "block-id": "1743122759",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "As is common in NLP, interface usability and user experience are out of the scope of the evaluation."
                }
              ]
            }
          ]
        },
        {
          "title": "Information Verification \\& Auditing",
          "block-id": "1743122761",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743122765",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122762",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Some prior work has explored the different stages of document editing, either through a design space of  for writing support tools, or through the survey of authors on the lifespan of their documents ."
                },
                {
                  "block-id": "1743122763",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Both works find a need for specialized interfaces to support each stage of writing, and suggest a common review phase that follows an editing phase."
                },
                {
                  "block-id": "1743122764",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In InkSync, we separate editing and auditing phases through a specialized interface, with a novel focus on tracing content provenance and verifying the factual accuracy of system-generated content."
                }
              ]
            },
            {
              "block-id": "1743122771",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122766",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Factual verification is an active NLP research area, with two task configurations: closed- and open-domain."
                },
                {
                  "block-id": "1743122767",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In closed-domain verification, such as inconsistency detection in summarization , a model must assess whether system-generated content (i.e., a summary) is consistent with provided source content (i.e., a document), and multiple modeling solutions have been proposed ."
                },
                {
                  "block-id": "1743122768",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Open-domain verification is more challenging, as it requires retrieving relevant documents and recording evidence sentences, with a community centering around benchmarks such as FEVER  and proposing methods to detect misinformation ."
                },
                {
                  "block-id": "1743122769",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In InkSync, verification is open-domain (it requires verifying information not in the document), but limits the scope to individual edits, and puts the author at the center of the process."
                },
                {
                  "block-id": "1743122770",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The system suggests search queries, but the author ultimately decides on searches to conduct and on the ultimate accuracy label."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "title": "Survey on Current Text Editing Practices",
      "block-id": "1743122772",
      "summary": "",
      "intent": "",
      "type": "section",
      "content": [
        {
          "block-id": "1743122774",
          "summary": "",
          "intent": "",
          "type": "paragraph",
          "content": [
            {
              "block-id": "1743122773",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "We conducted a short survey to gain insights into common practices with regard to text editing and the use of LLM-based conversational interfaces to accomplish text editing goals."
            }
          ]
        },
        {
          "title": "Survey and Study Participant Recruitment",
          "block-id": "1743122775",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743122778",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122776",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The first author's organization does not have an IRB approval process in place; instead, the survey and study designs were reviewed by a member of the ethics committee of that organization."
                },
                {
                  "block-id": "1743122777",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Personally identifiable information (email) was collected but not stored, and all participants were informed that anonymized usage data would be collected for the purposes of research."
                }
              ]
            },
            {
              "block-id": "1743122782",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122779",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The survey was shared publicly on an online messaging platform for US-based knowledge workers and consisted of 6 multiple-choice questions, which we estimate would take 2-3 minutes to complete."
                },
                {
                  "block-id": "1743122780",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Participants were not compensated for completing this survey, however, they were later invited to participate in the usability studies which were of longer duration and were compensated."
                },
                {
                  "block-id": "1743122781",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "For the studies, participants were compensated at a rate of 36 USD/hour and were informed that they could leave the study at any time without penalty."
                }
              ]
            }
          ]
        },
        {
          "title": "Survey Results",
          "block-id": "1743122783",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743122786",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122784",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In total 64 participants responded to the survey."
                },
                {
                  "block-id": "1743122785",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We did not ask participants to provide their gender or age but collected participants' roles within the organization: 39\\% of participants are engineers (e.g., Software Engineering, Technical Consultant/Architect), 29\\% occupy business-related roles (e.g., Product Managers, Accountant), 18\\% work in sales-related roles (e.g., Account Executive, Success Manager, etc.), and 14\\% occupy technical-writing roles (e.g., Technical Writer, Content Strategist)."
                }
              ]
            },
            {
              "block-id": "1743122790",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122787",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Figure~ shows the six survey questions and the aggregated results."
                },
                {
                  "block-id": "1743122788",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Most respondents edit text documents multiple times a day (Figure~), and most frequently edit emails, manuals, and reports (Figure~)."
                },
                {
                  "block-id": "1743122789",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The following paragraphs summarize the results regarding LLM-based editing."
                }
              ]
            },
            {
              "block-id": "1743122793",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122791",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We note that our findings are representative of a professional population working in the U.S."
                },
                {
                  "block-id": "1743122792",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "and may not generalize."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "title": "InkSync System Components and Interface",
      "block-id": "1743122794",
      "summary": "",
      "intent": "",
      "type": "section",
      "content": [
        {
          "block-id": "1743122798",
          "summary": "",
          "intent": "",
          "type": "paragraph",
          "content": [
            {
              "block-id": "1743122795",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "In a standard LLM-based conversational interface, the system replies to a user query (also called a message or a prompt) with an answer formatted in plain text."
            },
            {
              "block-id": "1743122796",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "If the user query includes a document to be edited, the plain text reply may include a revised version of the document along with high-level feedback."
            },
            {
              "block-id": "1743122797",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "The user must then read the plain text reply, and decide which editing suggestions to manually incorporate into the original document."
            }
          ]
        },
        {
          "block-id": "1743122804",
          "summary": "",
          "intent": "",
          "type": "paragraph",
          "content": [
            {
              "block-id": "1743122799",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "InkSync conversational components can reply to an author query both with a plain text reply in the chatbox and with a suggested list of ."
            },
            {
              "block-id": "1743122800",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "These executable edits are placed  that is being edited and are visually marked via underlines."
            },
            {
              "block-id": "1743122801",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "The underlines remain visible in the document until the author either accepts or dismisses the suggestions."
            },
            {
              "block-id": "1743122802",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "This allows the author to see precisely what the suggestions are and where they occur in the document."
            },
            {
              "block-id": "1743122803",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "Executable edits require the LLM to generate its edits in a specific format, which can be interpreted by the text editor."
            }
          ]
        },
        {
          "block-id": "1743122812",
          "summary": "",
          "intent": "",
          "type": "paragraph",
          "content": [
            {
              "block-id": "1743122805",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "Figure~ provides an annotated screenshot of the InkSync text editor."
            },
            {
              "block-id": "1743122806",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "The leftmost panel allows for the creation of new documents and the editing of saved documents."
            },
            {
              "block-id": "1743122807",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "The ``Audit Interface'' button in the bottom left allows the author to switch between the edit and the audit view of the active document."
            },
            {
              "block-id": "1743122808",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "The center main panel displays the latest version of the document being edited in the text editor panel."
            },
            {
              "block-id": "1743122809",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "In the editing panel, the author can manually edit the document, or view, accept, and dismiss system suggestions."
            },
            {
              "block-id": "1743122810",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "The rightmost panel displays the editing controls, including the Markers, Chat, Comment, and Verify tabs."
            },
            {
              "block-id": "1743122811",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "Additional interface features are shown in Figure~."
            }
          ]
        },
        {
          "block-id": "1743122815",
          "summary": "",
          "intent": "",
          "type": "paragraph",
          "content": [
            {
              "block-id": "1743122813",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "In this section, we first explain the system components of InkSync  (Section~)."
            },
            {
              "block-id": "1743122814",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "Next, we describe the interface components in detail: the four edit-suggesting components (Section~), and the Warn-Verify-Audit framework (Section~)."
            }
          ]
        },
        {
          "title": "InkSync System Components",
          "block-id": "1743122817",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743122824",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122818",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In InkSync, when an LLM-based component suggests executable edits to the author, it must generate the edits in a JSON format to be used in the editing tool."
                },
                {
                  "block-id": "1743122819",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "This representation includes the original text, the suggested replacement text, and a flag indicating if the replacement text includes new information."
                },
                {
                  "block-id": "1743122820",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The schema for the JSON is shown in this example:"
                },
                {
                  "block-id": "1743122821",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "\"original_text\": \"Lets plan a trip too Paris.\","
                },
                {
                  "block-id": "1743122822",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "\"replace_text\":  \"Let's plan a trip to Paris.\","
                },
                {
                  "block-id": "1743122823",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "\"component\":     \"marker_TYPO\","
                }
              ]
            },
            {
              "block-id": "1743122834",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122825",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The definitions for the keys and acceptable values are the following:"
                },
                {
                  "block-id": "1743122826",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "• \\texttt: A string exactly present in the draft."
                },
                {
                  "block-id": "1743122827",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "If the string is not present at least once in the draft, the edit is discarded,"
                },
                {
                  "block-id": "1743122828",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "• \\texttt: A string to replace the \\texttt string with when the edit is accepted by the user,"
                },
                {
                  "block-id": "1743122829",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "• \\texttt: The component that originated the edit (options \\texttt, \\texttt, \\texttt, and \\texttt, and an optional subcomponent (e.g., \\texttt),"
                },
                {
                  "block-id": "1743122830",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "• \\texttt (optional): If the value is set to \\texttt, and the \\texttt string appears more than once in the draft, multiple edit suggestions are shown to the user, otherwise, only the first occurrence is suggested as an edit."
                },
                {
                  "block-id": "1743122831",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Default value is \\texttt,"
                },
                {
                  "block-id": "1743122832",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "• \\texttt (optional): If the value is set to \\texttt, the edit is marked as introducing new information to the document."
                },
                {
                  "block-id": "1743122833",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The default value is \\texttt."
                }
              ]
            },
            {
              "block-id": "1743122837",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122835",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In the interface, each executable edit suggestion is underlined using a style (e.g., solid, dotted, etc.) and color that identifies the component of the system that created the edit."
                },
                {
                  "block-id": "1743122836",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The author can hover over an edit suggestion to view an overlaid menu to Accept or Dismiss the edit."
                }
              ]
            },
            {
              "block-id": "1743122840",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122838",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "When presenting an edit suggestion in the interface, a word-level sequence alignment is computed between the \\texttt and \\texttt strings using the Levenshtein algorithm , and displayed with colors indicated \\textcolor and \\textcolor words."
                },
                {
                  "block-id": "1743122839",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The alignment sequence and edit alignment visualization for the example edit is:"
                }
              ]
            },
            {
              "block-id": "1743122844",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122841",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "When an edit is accepted, the  is replaced by the ."
                },
                {
                  "block-id": "1743122842",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "When an edit is dismissed, the  remains unchanged."
                },
                {
                  "block-id": "1743122843",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In both cases the editing interface is ``cleaned up'': the edit's underlines and strike-through are removed, visually clearing the edit from the text editor."
                }
              ]
            },
            {
              "block-id": "1743122849",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122845",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The author can choose between two view modes for the edit suggestions:  and ."
                },
                {
                  "block-id": "1743122846",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In Inline mode, the edit alignment visualization is directly embedded in the text editor panel."
                },
                {
                  "block-id": "1743122847",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In Hover mode, only the  is shown in the text editor panel, and the alignment sequence is shown in an overlaid window."
                },
                {
                  "block-id": "1743122848",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The edit view mode can be controlled from the View Panel, in the right-most Settings column (illustrated in Figure~)."
                }
              ]
            },
            {
              "block-id": "1743122852",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122850",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "When designing this editing interface, we had to make choices among a number of tradeoffs."
                },
                {
                  "block-id": "1743122851",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Our objective is to maximize edit suggestion clarity, and with this goal in mind we made the following decisions:"
                }
              ]
            },
            {
              "block-id": "1743122857",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122853",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Each of the four edit-suggesting components is implemented with a single prompt to an LLM."
                },
                {
                  "block-id": "1743122854",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Each prompt is composed of (1) a high-level description of the component, (2) the latest version of the document, (3) author queries when applicable, and (4) the design choices of the InkSync system."
                },
                {
                  "block-id": "1743122855",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Each prompt further provides 3 examples on simplified single-sentence documents to illustrate desired behavior and output format."
                },
                {
                  "block-id": "1743122856",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Appendix~ concretely illustrates the prompt design used for the Chat component."
                }
              ]
            },
            {
              "block-id": "1743122860",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122858",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "For all prompts, the LLM is expected to return a valid JSON string that follows a predefined schema and contains the list of executable edit suggestions from the system."
                },
                {
                  "block-id": "1743122859",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In cases where the LLM does not return a valid JSON, a system error is forwarded to the user, suggesting to try again."
                }
              ]
            },
            {
              "block-id": "1743122864",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122861",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The InkSync system is compatible with any LLM since each component's prompt defines the information format it requires to operate."
                },
                {
                  "block-id": "1743122862",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In the two usability studies we conducted, we used OpenAI's GPT-4 LLM , as we found in initial experiments that it had a lower rate of failure due to invalid output formatting (roughly 2-5\\%), and produced higher quality edit suggestions than smaller alternatives such as GPT3.5-Turbo."
                },
                {
                  "block-id": "1743122863",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "GPT-4's size leads to slower system responses, and we analyze system response time in Appendix~."
                }
              ]
            }
          ]
        },
        {
          "title": "Edit-suggesting Components",
          "block-id": "1743122865",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743122867",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122866",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We now present the four components that can suggest edits in InkSync: Chat, Comment, Markers, and Brainstorm."
                }
              ]
            },
            {
              "block-id": "1743122870",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122868",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "A Chat panel resides in the bottom-right portion of the InkSync interface."
                },
                {
                  "block-id": "1743122869",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The author can send a message to the chat when seeking information (e.g., ``What is the capital of Argentina?'') or requesting edit suggestions (e.g., ``Locate and fix all typos'')."
                }
              ]
            },
            {
              "block-id": "1743122874",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122871",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "When the author sends a message, the system replies with (1) a plain text  shown in the Chat panel, and (2) some number of suggested edits that are shown in the main text editing panel (in our studies, the number of edit suggestions in response to a query ranged from 0 to 14)."
                },
                {
                  "block-id": "1743122872",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In Figure~, the user prompted the system with: ``let's give some dish examples'' and the system responded with three dish suggestions which are displayed both as an executable edit and summarized in the conversational reply panel in the lower right."
                },
                {
                  "block-id": "1743122873",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In cases where the user is seeking information (e.g., ``what is the capital of Argentina?'') and not editing suggestions, the system is prompted to return solely a textual reply."
                }
              ]
            },
            {
              "block-id": "1743122879",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122875",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Importantly, the system autonomously determines the number of edits to suggest to the author."
                },
                {
                  "block-id": "1743122876",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Chat-originated edits are integrated into the main text editor panel and indicated with a solid black line."
                },
                {
                  "block-id": "1743122877",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "When there are multiple suggested chat-originated edits, the bottom of the chat panel indicates the number of edits, and gives the option to ``Accept All'' or ``Dismiss All''."
                },
                {
                  "block-id": "1743122878",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "This enables the user to accept chat edits individually (in the main panel) or as a group (in the Chat panel)."
                }
              ]
            },
            {
              "block-id": "1743122883",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122880",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The Chat component makes suggestions applicable to the entire document but does not allow the author to efficiently specify the desired location for edits."
                },
                {
                  "block-id": "1743122881",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The Comments component allows more fine-grained control in a conversational-style interface."
                },
                {
                  "block-id": "1743122882",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "For example, rather than querying the global chat with: ``Let's add more details at the end of the fifth paragraph'', the author can select a few words at the end of the fifth paragraph, create a Comment, and query: ``Let's add more details''."
                }
              ]
            },
            {
              "block-id": "1743122887",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122884",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Comments work in three steps, illustrated in Figure~."
                },
                {
                  "block-id": "1743122885",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The author first selects a span of text in the main editing panel, which causes a small dialogue box to pop up over the selected text."
                },
                {
                  "block-id": "1743122886",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "If the author clicks on the  Comment icon that appears below the selection, this causes a Comment to be created, signaled by a ."
                }
              ]
            },
            {
              "block-id": "1743122892",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122888",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Next, clicking on the yellow Comment span opens a localized, comment-specific conversation in the Additional Tabs panel."
                },
                {
                  "block-id": "1743122889",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "When the author enters a query into this panel, the system is provided with the text from the selected span and is instructed to focus its suggestions on that text and the nearby context."
                },
                {
                  "block-id": "1743122890",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "As with other edit suggestions, the author can choose to accept or dismiss the suggestion."
                },
                {
                  "block-id": "1743122891",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Finally, the author can click ``Resolve'' in the Comment panel which dismisses pending Comment suggestions and hides the yellow comment span from the edit view."
                }
              ]
            },
            {
              "block-id": "1743122895",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122893",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The Chat and Comment components are both reactive and only suggest edits upon user request."
                },
                {
                  "block-id": "1743122894",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The Markers component on the other hand is a collection of proactive edit-suggesting tools that run periodically in the background during an editing session and insert one or more edit suggestions directly into the document."
                }
              ]
            },
            {
              "block-id": "1743122898",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122896",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Each marker is designed to suggest edits for one specialty (e.g., fixing typos, formal tone writing, etc.), and has a corresponding name (Typo, Formal, Emojis, etc.) and underline style and color."
                },
                {
                  "block-id": "1743122897",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Figure~ shows marker suggestion examples: the Professional marker suggests an edit to replace ``Hey Paul'' with ``Dear Paul'' with a solid orange underline."
                }
              ]
            },
            {
              "block-id": "1743122902",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122899",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The Markers Panel in the interface lists active markers and allows the author to control their behavior."
                },
                {
                  "block-id": "1743122900",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The author can toggle each marker to make all of its suggestions  visible or  hidden, and can trigger an individual marker to rerun with the refresh icon ()."
                },
                {
                  "block-id": "1743122901",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Finally, a marker can be edited and deleted through a marker editing menu ()."
                }
              ]
            },
            {
              "block-id": "1743122905",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122903",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The Markers component functions by providing the exact list of active markers and their descriptions in the prompt of the LLM that suggests edits."
                },
                {
                  "block-id": "1743122904",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "This gives the author the option to create a new marker, by choosing a marker name,  an underlining color and style, and an optional description that can provide precise instructions and examples."
                }
              ]
            },
            {
              "block-id": "1743122908",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122906",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We made a design choice of disallowing more than one edit suggestion for the same span of text."
                },
                {
                  "block-id": "1743122907",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "This choice can be limiting when an author is looking for multiple rephrasing options for a given passage (e.g., help brainstorm options for the headline of a news article)."
                }
              ]
            },
            {
              "block-id": "1743122913",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122909",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The brainstorm component  allows authors to tell the system to suggest multiple ideas for a given span of text."
                },
                {
                  "block-id": "1743122910",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "A brainstorm is initiated by the author in the same way as the Comment, by selecting a passage of text in the document and viewing the Comment/Brainstorm dialogue box."
                },
                {
                  "block-id": "1743122911",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Once the author clicks on the brainstorm icon, the system is instructed to suggest 3-5 diverse paraphrases of the selected text, which are shown in a drop-down menu just beneath the selected text."
                },
                {
                  "block-id": "1743122912",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The author can then accept any of the provided options, or dismiss the brainstorm window (see Figure~ for an example Brainstorm interaction)."
                }
              ]
            },
            {
              "block-id": "1743122916",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122914",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The four edit-suggesting components require the user to leave the text editing panel for activation, through clicking (Markers, Brainstorm), or writing in a separate dialogue box (Chat, Comment), which might disrupt the user's focus."
                },
                {
                  "block-id": "1743122915",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We implement bracket shortcuts that allow the author to initiate a Comment or Brainstorm from the text editor."
                }
              ]
            },
            {
              "block-id": "1743122919",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122917",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The user can put any passage within , which the system initially classifies as a  or ."
                },
                {
                  "block-id": "1743122918",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "A command is any extraneous text that will not be part of the final document (e.g., ), whereas content is a passage that is an integral part of the document (e.g., Egypt is a  place)."
                }
              ]
            },
            {
              "block-id": "1743122923",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122920",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "If the system determines that the bracketed text is a command, it initiates a comment and automatically sends the command as the first user message in the conversation."
                },
                {
                  "block-id": "1743122921",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "If the bracketed text is categorized as content, a brainstorm is initiated."
                },
                {
                  "block-id": "1743122922",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In short, the bracket shortcut lowers the effort required to initiate a Comment or Brainstorm."
                }
              ]
            }
          ]
        },
        {
          "title": "Warn-Verify-Audit Framework",
          "block-id": "1743122924",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743122928",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122925",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Some of the suggested edits might introduce new information to the document, which might be factually incorrect."
                },
                {
                  "block-id": "1743122926",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Factual inaccuracies in system responses can both result in the highly undesirable outcome of introducing incorrect information into communication and can also negatively affect users' trust in LLM-based systems."
                },
                {
                  "block-id": "1743122927",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Therefore, we introduce a fact verification aid into InkSync."
                }
              ]
            },
            {
              "block-id": "1743122932",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122929",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Our verification pipeline relies on the observation that even though the LLM might not be capable of detecting if newly introduced information is inaccurate, it might be capable of assessing if an edit introduces new information that goes beyond what was written by the author in the document."
                },
                {
                  "block-id": "1743122930",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Having a notice about new information could be used to warn the author and give them an opportunity to verify the information before accepting the edit."
                },
                {
                  "block-id": "1743122931",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Therefore, the InkSync prompt is designed such that the LLM augments all edit-suggesting components of InkSync to assign a binary label to the edits they generate, indicating whether the edit introduces new information or not (the  key in the executable edit language)."
                }
              ]
            },
            {
              "block-id": "1743122936",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122933",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We performed a manual analysis to determine how accurate the detection of new information is."
                },
                {
                  "block-id": "1743122934",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We randomly selected 200 edits from the 12,000+ edits the system suggested to participants in the usability studies, selecting 100 edits the system predicted as , and 100 with ."
                },
                {
                  "block-id": "1743122935",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We shuffled the samples, hid the system label predictions, and performed a manual annotation of the label."
                }
              ]
            },
            {
              "block-id": "1743122940",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122937",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We find that the manual label agrees with the system-predicted  prediction 97.5\\% of the time."
                },
                {
                  "block-id": "1743122938",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Inspection of the five disagreement cases reveals that they are ambiguous borderline cases (e.g., ``Your   awaits!'')."
                },
                {
                  "block-id": "1743122939",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "This small-scale manual annotation confirms empirically that GPT-4 can predict when an edit introduces new information accurately."
                }
              ]
            },
            {
              "block-id": "1743122942",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122941",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "As shown in Figure~ (left), when the system detects that a suggested edit introduces new information, it augments the Accept/Dismiss menu to show the author a visual warning which states: `` Edit contains new ''."
                }
              ]
            },
            {
              "block-id": "1743122947",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122943",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In addition to the warning, a `` Verify'' action is inserted into the menu."
                },
                {
                  "block-id": "1743122944",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "If the user clicks on the Verify button, the Verify component prompts an LLM to generate a list of search engine queries that can be used to verify the new information in the edit."
                },
                {
                  "block-id": "1743122945",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The search engine queries are presented in the interface in a verification panel (Figure~, center)."
                },
                {
                  "block-id": "1743122946",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "If the user clicks on a generated search engine query, the system opens a new browser tab to the Google search engine populated with the query."
                }
              ]
            },
            {
              "block-id": "1743122950",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122948",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Automatically generating search engine queries is intended to reduce the amount of work required from the author to verify system-introduced information."
                },
                {
                  "block-id": "1743122949",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Opening the search engine query in a separate interface allows the user to refine and deepen the search before coming back to the InkSync interface."
                }
              ]
            },
            {
              "block-id": "1743122953",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122951",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Once the author forms an opinion on the accuracy of the edit, they can optionally mark the edit with one of three labels: ``Verified'', ``Incorrect'', and ``Not Sure'', and can make an informed decision on whether to accept the edit into their document or dismiss it."
                },
                {
                  "block-id": "1743122952",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The Incorrect mark can be used to remind the author that they want to come back later and change that piece of information."
                }
              ]
            },
            {
              "block-id": "1743122956",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122954",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In the editing interface, once an author accepts an edit suggestion, the changes are stored and no longer visible."
                },
                {
                  "block-id": "1743122955",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "As the editing session progresses, the author might lose track of the edit suggestions' content they accepted."
                }
              ]
            },
            {
              "block-id": "1743122960",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122957",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "To facilitate provenance tracing within the document, we developed an Audit interface that complements the Edit interface."
                },
                {
                  "block-id": "1743122958",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The Audit interface empowers an auditor -- optionally distinct from the author -- to efficiently review the product of the editing process, confirm the accuracy of system-generated content, and potentially flag inaccuracies."
                },
                {
                  "block-id": "1743122959",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The Audit Interface (Figure~) provides a non-editable view of the document, highlighting any system-generated content present in the document from previously accepted edits during editing."
                }
              ]
            },
            {
              "block-id": "1743122964",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122961",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In the Audit interface, any system-originated content is highlighted using a color scheme based on whether it introduces new information (yellow) or not (grey)."
                },
                {
                  "block-id": "1743122962",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "If the auditor hovers over system-generated content, they are shown an action menu that allows them to Verify the edit (process described in Section~) or directly assign a verification label."
                },
                {
                  "block-id": "1743122963",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Once the auditor assigns a verification label, its highlighting color is modified to green (Verified), red (Incorrect), or Orange (Not Sure)."
                }
              ]
            },
            {
              "block-id": "1743122967",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122965",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "If the mode is switched from Audit to Edit, the author can resume editing the draft, and the verification information is made visible in that mode."
                },
                {
                  "block-id": "1743122966",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The tracing of system-generated content requires a character-level alignment algorithm, which we detail in Appendix~."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "title": "Usability Study 1: Interaction Style Evaluation",
      "block-id": "1743122968",
      "summary": "",
      "intent": "",
      "type": "section",
      "content": [
        {
          "block-id": "1743122974",
          "summary": "",
          "intent": "",
          "type": "paragraph",
          "content": [
            {
              "block-id": "1743122969",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "We conducted a 20-minute within-participants usability study with 55 participants, framed around the task of customizing sales emails for a fictional InkSync travel agency."
            },
            {
              "block-id": "1743122970",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "The objectives were to:"
            },
            {
              "block-id": "1743122971",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "• Assess the usability of the four edit-suggesting components of InkSync, in comparison to existing baselines,"
            },
            {
              "block-id": "1743122972",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "• Determine which editing objectives each InkSync component is most useful for,"
            },
            {
              "block-id": "1743122973",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "• Ascertain participant preferences about the conditions included in the study."
            }
          ]
        },
        {
          "title": "Participants",
          "block-id": "1743122975",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743122978",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122976",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We recruited participants from our initial survey respondents and added referred participants to the study by initial participants."
                },
                {
                  "block-id": "1743122977",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Thus, Study 1 participants do not entirely overlap with initial survey respondents."
                }
              ]
            },
            {
              "block-id": "1743122982",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122979",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We reviewed the tasks completed by all participants and found that all participants understood the task clearly and applied themselves enough such that no participant filtering was required."
                },
                {
                  "block-id": "1743122980",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Three participants completed the study during an OpenAI outage, which caused the system to have limited operability."
                },
                {
                  "block-id": "1743122981",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Those participants were paid, but their data was excluded, resulting in 52 participants' data being included in the results and analysis."
                }
              ]
            }
          ]
        },
        {
          "title": "Study Procedure",
          "block-id": "1743122983",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743122988",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122984",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The study consisted of three 6-minute editing sessions and a 2-minute survey, for a total of 20 minutes."
                },
                {
                  "block-id": "1743122985",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The study followed a partial within-participants design, in that each participant completed a task with 3 out of the 6 interface conditions."
                },
                {
                  "block-id": "1743122986",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Therefore, each interface condition was seen by 29-35 participants."
                },
                {
                  "block-id": "1743122987",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We randomized the selection and order of interface conditions and assigned tasks."
                }
              ]
            },
            {
              "block-id": "1743122992",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122989",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Each session began with a one-minute introductory slide deck on the current condition's features, followed by a five-minute task to edit and customize an email template from a fictional travel agency."
                },
                {
                  "block-id": "1743122990",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Each task provides (1) an initial email template, (2) a fictional recipient name, (3) a target travel destination, and (4) a persona trait for the participant."
                },
                {
                  "block-id": "1743122991",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Appendix~ provides the exact destination and persona traits used."
                }
              ]
            },
            {
              "block-id": "1743122995",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122993",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The participants were provided two editing objectives: first, to ensure the email had a formal tone and was professional, and second, to customize the email by providing specific suggestions relevant to the recipient's persona and travel destination."
                },
                {
                  "block-id": "1743122994",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In the introductory material, participants were shown an example customized email for a persona and target destination that was not included in the study conditions (a lover of the Opera going to Rome)."
                }
              ]
            },
            {
              "block-id": "1743123000",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743122996",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Since each participant completed three tasks, we prepared three generic email templates each containing several informal phrases (e.g."
                },
                {
                  "block-id": "1743122997",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "``wanna go on a vacation''), and grammatical errors (e.g., ``Dont miss out''), randomly assigned."
                },
                {
                  "block-id": "1743122998",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The original templates ranged from 100 to 250 words in length."
                },
                {
                  "block-id": "1743122999",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Appendix~ shows one of the email templates used and Figure~ in the Appendix provides a concrete example of a study participant's editing session."
                }
              ]
            },
            {
              "block-id": "1743123002",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123001",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We included six interface conditions in the study:"
                }
              ]
            },
            {
              "block-id": "1743123004",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123003",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Note that none of the conditions contained the Warn, Verify, or Audit components of InkSync since those components are evaluated in a follow-up study, Usability Study 2 (Section~)."
                }
              ]
            },
            {
              "block-id": "1743123006",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123005",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Since participants completed the study unmoderated, we implemented additional controls in the interface -- details in Appendix~ -- to help ensure the validity of the findings."
                }
              ]
            }
          ]
        },
        {
          "title": "Evaluation Methodology and Results",
          "block-id": "1743123007",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743123009",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123008",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We evaluate participants' completed sessions through multiple complementary lenses: (1) achievement of editing goal, (2) editing efficiency, (3) diversity of responses, (4) participant preference, (5) comparison of Chat and Comment conversations, and (6) factual accuracy."
                }
              ]
            },
            {
              "block-id": "1743123013",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123010",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "To assess significance testing, we ran standard t-tests, applying the Bonferroni correction  when multiple tests were performed on the same data."
                },
                {
                  "block-id": "1743123011",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We also performed bootstrap re-sampling  to determine the minimum number of participants required to achieve statistical significance ($p < 0.05$)."
                },
                {
                  "block-id": "1743123012",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Details on statistical testing appear in Appendix~."
                }
              ]
            },
            {
              "block-id": "1743123017",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123014",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We quantitatively measure participants' achievement of the two editing objectives based on the last version of the document at the end of the editing session."
                },
                {
                  "block-id": "1743123015",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "For the first objective -- ensuring the email has a formal tone and is professional -- we identify and count the number of typos, grammatical errors, and informal phrases in the email, and name this quantity ."
                },
                {
                  "block-id": "1743123016",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "For the second objective -- customizing the email to the target destination and persona -- we identify and count the number of personalized suggestions related to the destination (e.g., suggesting the Eiffel Tower for a trip to Paris), or persona (e.g., suggesting Le Bernardin restaurant in New York for a food lover persona) in the email, and name this quantity ."
                }
              ]
            },
            {
              "block-id": "1743123020",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123018",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We note that for Objective A, a lower quantity is preferred, and a higher quantity is preferred for Objective B."
                },
                {
                  "block-id": "1743123019",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Annotation was completed in two stages: automatic annotation with an LLM, followed by manual verification (details on the annotation in Appendix~)."
                }
              ]
            },
            {
              "block-id": "1743123024",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123021",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Table~ lists the average Objective scores under each interface condition."
                },
                {
                  "block-id": "1743123022",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Focusing on Objective A, none of the interfaces lead to an ideal score of 0 (no detected issue) yet there are noteworthy differences."
                },
                {
                  "block-id": "1743123023",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The two conditions that require manual editing (Manual, NoEx Chat) lead to the highest number of errors compared to the other four conditions (not significant, $p>0.05$), while interfaces with the Markers component (Markers, 4-Comp) achieve the best performance on Objective A, with roughly half as many errors as other conditions ($p<0.01$)."
                }
              ]
            },
            {
              "block-id": "1743123026",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123025",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "For Objective B, interfaces without a conversational component (Manual, Markers) lead to the least amount of customization, with 1-3 customizations on average, outperformed by other conditions with a conversational component ($p<0.01$), that all include 4-5 customizations."
                }
              ]
            },
            {
              "block-id": "1743123028",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123027",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Comparing the NoEx Chat and Chat conditions, executable edits slightly improve scores on both objectives, confirming that executable edits enable efficient integration of suggestions, and reduction of editing errors (not significant, $p>0.05$)."
                }
              ]
            },
            {
              "block-id": "1743123031",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123029",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In summary, as shown in Table~, ."
                },
                {
                  "block-id": "1743123030",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The 4-Comp condition -- which has both Markers and conversational components -- leads to the best joint performance, supporting the additive benefits of the edit-suggesting components of InkSync."
                }
              ]
            },
            {
              "block-id": "1743123037",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123032",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We measure editing efficiency by recording the edit distance -- in the number of characters -- between the current version and the initial email template."
                },
                {
                  "block-id": "1743123033",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "This distance is recorded every few seconds during the editing session."
                },
                {
                  "block-id": "1743123034",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "This allows us to calculate the average edit distance over time for each interface condition, which represents how quickly participants diverge from the initial template."
                },
                {
                  "block-id": "1743123035",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Although editing efficiency does not explicitly measure success at the editing task, it indirectly measures the ease of editing to allow comparisons across each interface condition."
                },
                {
                  "block-id": "1743123036",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Figure~ plots the results of the analysis."
                }
              ]
            },
            {
              "block-id": "1743123040",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123038",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Participants in the NoEx Chat condition had the slowest editing speed overall ($p<0.05$), followed by the Manual condition."
                },
                {
                  "block-id": "1743123039",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The slower editing in the NoEx Chat condition is probably caused by the need for participants to split their time and attention between the chat, and the manual integration of the chat's suggestions into the draft."
                }
              ]
            },
            {
              "block-id": "1743123043",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123041",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "An important consideration of using LLMs to assist with writing tasks is whether they affect the creativity of the user."
                },
                {
                  "block-id": "1743123042",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Creativity is often defined through the concept of divergent thinking , in which a person or group generates multiple ideas or solutions to a problem; in this framing, creativity can be measured quantitatively by the number of distinct ideas generated ."
                }
              ]
            },
            {
              "block-id": "1743123046",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123044",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We use this idea to develop a quantitative method to measure the customization divergence in each interface condition."
                },
                {
                  "block-id": "1743123045",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We manually cluster all customized recommendations extracted for  and assign each recommendation to one of three classes: (1)  are suggested in 5+ emails (e.g., the pyramid of Giza in Egypt), (2),  are suggested in 2-4 emails (e.g., a visit of the Luxor Temple in Egypt), and (3)  are suggested in only one email (e.g., a visit to the El Tahrir Square in Cairo)."
                }
              ]
            },
            {
              "block-id": "1743123049",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123047",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In Figure~, we depict the recommendation class proportions for each study condition."
                },
                {
                  "block-id": "1743123048",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We find that the Manual and Markers conditions -- ones with no conversational component -- yield the highest proportion of unique recommendations."
                }
              ]
            },
            {
              "block-id": "1743123052",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123050",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In other words, we find evidence that the use of a conversational LLM in the Chat and Comment components leads to less original recommendations, a sign of reduced divergence in study participants, indicative of lowered creativity."
                },
                {
                  "block-id": "1743123051",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "This finding is in accordance with recent work in argumentative essay writing ."
                }
              ]
            },
            {
              "block-id": "1743123056",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123053",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Participants completed a survey as the last step of the study."
                },
                {
                  "block-id": "1743123054",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "First, participants answered 9 Likert-scale questions about each of the three conditions they engaged with, with results presented in Table~."
                },
                {
                  "block-id": "1743123055",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Second, participants ranked the three conditions; ranking results are compiled in Figure~."
                }
              ]
            },
            {
              "block-id": "1743123058",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123057",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The Manual and NoEx Chat conditions were ranked the lowest ($p<0.01$), and Likert answers indicate participants were least likely to agree that those systems are helpful in completing the task and provide easy-to-integrate suggestions."
                }
              ]
            },
            {
              "block-id": "1743123060",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123059",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Participants preferred the 4-Comp condition and the Chat condition most (no significant difference between these two), with Likert responses indicating that system suggestions were the easiest to understand, adjust, and integrate."
                }
              ]
            },
            {
              "block-id": "1743123063",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123061",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Surprisingly, participants felt it was equally easy to specify the desired location of an edit in the Comment and Chat conditions (no statistical difference)."
                },
                {
                  "block-id": "1743123062",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "One hypothesis for this lack of a difference is that the emails are relatively short documents and that the benefits of precisely localized conversations would only materialize in longer documents."
                }
              ]
            },
            {
              "block-id": "1743123067",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123064",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The Chat and Comment components each provide a conversational interface to the participant."
                },
                {
                  "block-id": "1743123065",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In Appendix~, we describe an analysis we performed on all the Chat and Comment conversations of Study 1 participants."
                },
                {
                  "block-id": "1743123066",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Figure~ provides illustrative Chat and Comment conversations from participants in the study, and Table~ summarizes key qualitative differences."
                }
              ]
            },
            {
              "block-id": "1743123073",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123068",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "At a high level,  Chat conversations are longer (8.6 vs."
                },
                {
                  "block-id": "1743123069",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "3.0 messages), and have author queries with more diverse intents; they request edits of local and global scope while not usually specifying localization explicitly."
                },
                {
                  "block-id": "1743123070",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "This causes the system to have to implicitly resolve ambiguity and respond with a wider variation in the number of suggested edits."
                },
                {
                  "block-id": "1743123071",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "By contrast, Comment conversations are shorter, with participants predominantly requesting edits of local scope."
                },
                {
                  "block-id": "1743123072",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The Comment component frequently suggests a single edit, representing a much more focused and efficient localized conversation."
                }
              ]
            },
            {
              "block-id": "1743123078",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123074",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The final evaluation centers on the factual accuracy of the information added by participants to the emails."
                },
                {
                  "block-id": "1743123075",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We reviewed each email and identified any recommendation that was not accurate for the target destination or persona, identifying three categories of error: (1) overselling (e.g., claiming that Paris is an affordable city), (2) destination-related errors (e.g., recommending to visit a zoo that permanently closed in 2017), (3) persona-related errors (e.g., recommending a bike tour for a person with limited mobility)."
                },
                {
                  "block-id": "1743123076",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Besides the error category, we manually attributed a severity to each identified error of Minor or Major, following the MQM annotation format ."
                },
                {
                  "block-id": "1743123077",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Appendix~ details the annotation procedure, with Table~ listing examples of each error category and severity, and Table~ breaking down error counts by study condition."
                }
              ]
            },
            {
              "block-id": "1743123081",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123079",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "A key limitation of this analysis is our reliance on automation for error detection, possibly resulting in undetected factual errors and underestimating the actual number of factual errors in the documents."
                },
                {
                  "block-id": "1743123080",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Thus the error percentages reported here should be considered a lower bound."
                }
              ]
            },
            {
              "block-id": "1743123085",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123082",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Factual errors occur in all conditions (including the manual interface condition)."
                },
                {
                  "block-id": "1743123083",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": ", compared to 6\\% for non-conversational interfaces (Manual, Markers)."
                },
                {
                  "block-id": "1743123084",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In summary, we find evidence that recommendations made by the system in conditions with conversational components lead to a higher likelihood of the participant integrating a major factual error in the email."
                }
              ]
            },
            {
              "block-id": "1743123087",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123086",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In the following study, we assess the efficacy of the Warn-Verify-Audit framework to reduce factual errors."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "title": "Usability Study 2: Warn, Verify and Audit",
      "block-id": "1743123088",
      "summary": "",
      "intent": "",
      "type": "section",
      "content": [
        {
          "block-id": "1743123094",
          "summary": "",
          "intent": "",
          "type": "paragraph",
          "content": [
            {
              "block-id": "1743123089",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "We conducted a 20-minute within-participants usability study with 35 participants, based on the same task as Study 1, but modified to increase the chance of system-generated inaccuracies, enabling us to evaluate the Warn, Verify, and Audit components of InkSync."
            },
            {
              "block-id": "1743123090",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "The objectives were to:"
            },
            {
              "block-id": "1743123091",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "• Determine whether the Warn, Verify and Audit components can help authors detect factual errors and avoid integrating them into their documents,"
            },
            {
              "block-id": "1743123092",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "• Assess whether the search engine queries produced by the Verify component are adequate and sufficient for users to verify the suggested edit's accuracy,"
            },
            {
              "block-id": "1743123093",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "• Understand the differences between verifying information during the editing phase versus the auditing phase."
            }
          ]
        },
        {
          "title": "Participants",
          "block-id": "1743123095",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743123098",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123096",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We recruited participants from our initial survey respondents and added referred participants to the study by initial participants."
                },
                {
                  "block-id": "1743123097",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Sixteen days elapsed between the end of Study 1 and Study 2's start and all participants were provided with the necessary introductory material to complete the study."
                }
              ]
            }
          ]
        },
        {
          "title": "Modifying the System to Introduce Errors",
          "block-id": "1743123099",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743123102",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123100",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Since the focus of Study 2 is to evaluate the Warn, Verify, and Audit components, we removed the Markers, Comments, and Brainstorm components."
                },
                {
                  "block-id": "1743123101",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The Chat component was the only way for participants to receive system suggestions."
                }
              ]
            },
            {
              "block-id": "1743123106",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123103",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Since Study 2 assesses the helpfulness of system affordances in identifying errors, it is important to ensure that some errors occur in all editing sessions."
                },
                {
                  "block-id": "1743123104",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "To do so, we created a modified version of the Chat prompt, which we call the perturbed prompt, that is used to encourage the model to suggest inaccurate information."
                },
                {
                  "block-id": "1743123105",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "This is achieved by explicitly instructing the model to introduce subtle factual errors, and giving it examples of such errors (selected from Major errors identified in Study 1)."
                }
              ]
            },
            {
              "block-id": "1743123109",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123107",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "During editing tasks in Study 2, the system alternates between the standard and perturbed prompts when responding to user Chat queries, aiming for the system to suggest an equal number of factually accurate and inaccurate edits on average."
                },
                {
                  "block-id": "1743123108",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We manually verified that the perturbed prompt was effective in causing the model to suggest inaccurate edits and show examples of such edits in Appendix~."
                }
              ]
            }
          ]
        },
        {
          "title": "Study Procedure",
          "block-id": "1743123110",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743123113",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123111",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Study 2 follows the same format as Study 1, with three 6-minute tasks framed around email customization, followed by a 2-minute completion survey."
                },
                {
                  "block-id": "1743123112",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Study 2 consists of three tasks:"
                }
              ]
            },
            {
              "block-id": "1743123117",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123114",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "• Task 1: The participant customizes an initial email template without interface support for verification."
                },
                {
                  "block-id": "1743123115",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "• Task 2: The participant customizes an initial email template with the Warn and Verify components enabled."
                },
                {
                  "block-id": "1743123116",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "• Task 3: The participant audits an email edited by a participant in Task 1 or 2, in the Audit interface."
                }
              ]
            },
            {
              "block-id": "1743123120",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123118",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "For the editing tasks of Study 2, we reused the same fictional recipient names and personas from Study 1 but selected three new target destinations -- Madagascar, Jordan, and Malaysia -- focusing on destinations likely to be less familiar to US-based participants, increasing participants' reliance on the system for recommendation and verification."
                },
                {
                  "block-id": "1743123119",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In order to ensure that there is erroneous content to audit in the third task, we selected an email edited by a participant in the first two steps of the study with at least five integrated system edits, including both accurate and inaccurate edits."
                }
              ]
            },
            {
              "block-id": "1743123123",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123121",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "During the five-minute auditing task, the participant was instructed to verify all system-generated content in the document, marking each with a ``Verified'', ``Incorrect'', or ``Not Sure'' label."
                },
                {
                  "block-id": "1743123122",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "If the participant cannot complete all verifications in the allotted time, unmarked edits are assigned a ``Not Enough Time'' label for analysis purposes."
                }
              ]
            }
          ]
        },
        {
          "title": "Evaluation Methodology and Results",
          "block-id": "1743123124",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743123126",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123125",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We evaluate Warn, Verify, and Audit framework through statistics of the verification process, participant feedback, and participant success at detecting and preventing inaccuracies."
                }
              ]
            },
            {
              "block-id": "1743123129",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123127",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We track participant interactions with the Verify component and record relevant statistics, summarized in Figure~."
                },
                {
                  "block-id": "1743123128",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We report: (1) the  by the system when verification is initiated, (2) the  by participants from the suggested list, and (3) the : the time elapsed between verification initiation and the participant assigning an accuracy label to the edit."
                }
              ]
            },
            {
              "block-id": "1743123133",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123130",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In the 500+ verifications initiated by participants, the system generated between one and six search queries, and 2.6 on average (distribution in Figure~ (top))."
                },
                {
                  "block-id": "1743123131",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Participants visited 1+ recommended searches in 94\\% of cases and on average 1.67 (Figure~ (middle)), and on average visited 70\\% of recommended searches, suggesting that these offerings were often found helpful."
                },
                {
                  "block-id": "1743123132",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "On average, participants spent 44 seconds performing a verification, and 80\\% of the verifications were completed in under a minute, providing empirical evidence that the system enables participants to conduct information verification efficiently (distribution in Figure~ (bottom))."
                }
              ]
            },
            {
              "block-id": "1743123136",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123134",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The completion survey consisted of nine Likert-scale statements and two multiple-choice questions about various aspects of the Warn, Verify, and Audit components."
                },
                {
                  "block-id": "1743123135",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The statements, questions, and aggregated responses are shown in Figure~."
                }
              ]
            },
            {
              "block-id": "1743123139",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123137",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Regarding the accuracy of the system overall, participants were unlikely to agree that the information provided by the system was accurate (average 5-point Likert of 3.2)."
                },
                {
                  "block-id": "1743123138",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "This suggests that participants were aware of the system-introduced factual errors during the study."
                }
              ]
            },
            {
              "block-id": "1743123144",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123140",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Regarding the verification process, most participants found the ``new information'' warning to be useful (4.0) and thought that the verification process was straightforward (4.3)."
                },
                {
                  "block-id": "1743123141",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "When asked about the suggested search queries, participants were very likely to agree that the search queries are helpful (4.3), suggesting that this is a viable method for helping verify information while editing."
                },
                {
                  "block-id": "1743123142",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "However, the average is lower for the sufficiency of the search queries (3.8)."
                },
                {
                  "block-id": "1743123143",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "This gap suggests that fully completing a verification might require adapting or expanding the system-suggested searches (not significant $p>0.05$)."
                }
              ]
            },
            {
              "block-id": "1743123146",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123145",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Most participants were positive about the auditing interface, agreeing that it helped keep track of content that required verification (4.2) and that the auditing interface was easy to use (4.0)."
                }
              ]
            },
            {
              "block-id": "1743123151",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123147",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The final two questions asked participants to quantify their impressions of the verification process."
                },
                {
                  "block-id": "1743123148",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "When asked what proportion of the  were verifiable with the suggested search queries, 85\\% stated that most or all edits were verifiable."
                },
                {
                  "block-id": "1743123149",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "When asked what proportion of the  were  useful for verifying edits, most participants stated <30\\% of search queries were not useful in the verification process."
                },
                {
                  "block-id": "1743123150",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In summary, most of the suggested search queries were useful in the verification process and the system enabled participants to verify most edits that they chose to review."
                }
              ]
            },
            {
              "block-id": "1743123160",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123152",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Table~ summarizes key statistics of the two editing sessions -- Tasks 1 and 2."
                },
                {
                  "block-id": "1743123153",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Recall that Task 2 provided Warning and Verification support, while Task 1 did not."
                },
                {
                  "block-id": "1743123154",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "On average, participants had longer exchanges with the system in the Chat in Task 2 than in Task 1 (16.0 vs."
                },
                {
                  "block-id": "1743123155",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "13.7 messages exchanged), leading to a larger number of edits suggested to participants in Task 2 than in Task 1 (6.2 vs."
                },
                {
                  "block-id": "1743123156",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "5.5 suggested edits)."
                },
                {
                  "block-id": "1743123157",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In both conditions, the system recommended a similar proportion of accurate and inaccurate suggestions, as intended in the study's design."
                },
                {
                  "block-id": "1743123158",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We calculate a quantity called , which is the percentage of inaccurate suggested edits that participants dismissed and did not integrate into the final email."
                },
                {
                  "block-id": "1743123159",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "For instance, if the system suggests 5 inaccurate edits, and the participant dismisses 3 of them and 2 remain in the current draft,  is 60\\%."
                }
              ]
            },
            {
              "block-id": "1743123163",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123161",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Participants in Task 1, which did not include support for Warning and Verification, prevented only 23.4\\% of inaccurate suggestions (accepted 2.3 of the 3.0 inaccurate edit suggestions)."
                },
                {
                  "block-id": "1743123162",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Participants in Task 2, which did have support for Warning and Verification, prevented 43.5\\% of edits from being accepted into the draft (accepted 1.7 of the 3.1 inaccurate edit suggestions)."
                }
              ]
            },
            {
              "block-id": "1743123166",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123164",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "For the auditing task -- Task 3 -- we calculate a quantity called , which is the percentage of inaccurate edits in the audited document that are marked as ``Incorrect'' by the participant."
                },
                {
                  "block-id": "1743123165",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In other words, if the audited document contains a total of four inaccurate edits and the participant marks three of them as ``Incorrect'',  is 75\\%."
                }
              ]
            },
            {
              "block-id": "1743123172",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123167",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In Study 2, documents were either edited with or without verifications enabled (Task 1 vs."
                },
                {
                  "block-id": "1743123168",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Task 2) and the document was either audited or not (Task 3), leading to four possible conditions."
                },
                {
                  "block-id": "1743123169",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Figure~ provides statistics for documents in these four conditions, and the bottom row indicates the percentage of inaccurate edits that were either prevented or detected for each condition."
                },
                {
                  "block-id": "1743123170",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Documents that were edited with verification enabled, and audited in a secondary phase led to the highest rate of error avoidance at 73\\%."
                },
                {
                  "block-id": "1743123171",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": ", as it leads to the largest fraction of prevented and detected errors ($p<0.01$), more than three times as many as in the condition with neither in place."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "title": "Discussion",
      "block-id": "1743123173",
      "summary": "",
      "intent": "",
      "type": "section",
      "content": [
        {
          "title": "Implications",
          "block-id": "1743123174",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743123178",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123175",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Despite their recent introduction, and although they are known to have many drawbacks, chatbot-style LLMs are both extremely powerful and widely used for knowledge work today."
                },
                {
                  "block-id": "1743123176",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The research presented here shows that taking a human-centered stance that emphasizes human agency and control can lead to better outcomes."
                },
                {
                  "block-id": "1743123177",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The interface design and workflow of InkSync allow an author to see precisely which LLM suggestions have been made and how they integrate into the text."
                }
              ]
            },
            {
              "block-id": "1743123184",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123179",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The results of the two usability studies shed light on the details of this form of human-AI interaction."
                },
                {
                  "block-id": "1743123180",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We found that specialized query tools (the Markers), such as grammar checkers and tone adjusters, can lead to more accurate edits than open-ended queries alone."
                },
                {
                  "block-id": "1743123181",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "On the flip side, we found that open-ended queries (the Chat and Comment interactions), lead to more customization, as in a higher number of suggested places to go and things to do for a given persona and travel destination."
                },
                {
                  "block-id": "1743123182",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "At the same time, there was more redundancy in the suggestions made in the open-ended chat conversations than in the Manual and Markers conditions."
                },
                {
                  "block-id": "1743123183",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In other words, people writing manually were more creative in the content they produced, but they produced less new content."
                }
              ]
            },
            {
              "block-id": "1743123187",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123185",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We found that open-ended conversation tools without verification controls lead to more factual errors than the same tools with scaffolded support for verification and fact-checking."
                },
                {
                  "block-id": "1743123186",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Our research shows a promising solution for how to provide this scaffolding: the Verify and Audit facilities help make the author aware of potentially problematic content generated by the LLM, and reduce the friction of repairing introduced factuality errors."
                }
              ]
            },
            {
              "block-id": "1743123189",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123188",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We also found that participants prefer using open-ended, controlled conversational LLMs over the other options, underscoring the point that because people like these tools, researchers need to determine how to provide scaffolding to increase their accuracy."
                }
              ]
            },
            {
              "block-id": "1743123192",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123190",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Altogether, our results provide guidance for the development of future LLM-based editing tools."
                },
                {
                  "block-id": "1743123191",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The InkSync software will be provided as open-source software, expanding the potential impact of this work by enabling other researchers to build upon it."
                }
              ]
            }
          ]
        },
        {
          "title": "Comparison to Existing Commercial Tools",
          "block-id": "1743123193",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743123198",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123194",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The interface design of the Markers component bears resemblance to modern text checkers such as Grammarly, which proactively detect errors and suggest corrections for a limited set of specialized tasks."
                },
                {
                  "block-id": "1743123195",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Results from Usability Study 1 confirm the effectiveness of such tools in helping authors improve the quality and tone of their writing but are limited by the inability of the author to specify suggestions other than those that are pre-specified in the tools."
                },
                {
                  "block-id": "1743123196",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Our design of Markers, paired with the use of LLMs as the backend correction tool, provides control to the author to define the scope of suggestions they want, based on their editing objectives."
                },
                {
                  "block-id": "1743123197",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "For example, when writing a social media post, the author might need markers that can work to help improve Engagingness or suggest Emojis to insert, while a teacher working on simplifying text for a classroom setting might need markers to automatically provide definitions to complex terms, split sentences, or suggest lexical substitutions."
                }
              ]
            },
            {
              "block-id": "1743123202",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123199",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Popular co-writing tools such as Google Docs and Overleaf integrate comment features that are similar in design to the Comment component of InkSync."
                },
                {
                  "block-id": "1743123200",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "As the commercial tools inevitably integrate LLM-based suggestions, our findings from Usability Study 1 on the use of Comments for focused localized editing indicate that comments are a good place for LLM-based interaction."
                },
                {
                  "block-id": "1743123201",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In a multi-author setting, however, the LLM would need to follow co-writing social norms and understand when it is appropriate to suggest edits to an author, and when a conversation only involves the human authors."
                }
              ]
            },
            {
              "block-id": "1743123207",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123203",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The Auditing interface of InkSync shares features with revision history tools such as Track Changes in Microsoft Word, or the version histories of Overleaf and Google Docs."
                },
                {
                  "block-id": "1743123204",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "A key distinction is that the auditing in InkSync centers around the latest version of the document focuses specifically on LLM-generated content, and provides verification functionality."
                },
                {
                  "block-id": "1743123205",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "By contrast, revision history tools focus on the evolution of the document over time and are designed to help authors understand the changes made by other (human) authors."
                },
                {
                  "block-id": "1743123206",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "As system-generated content makes its way into commercial writing tools, revision history tools will need to evolve to support both revision history and auditing of system-generated content."
                }
              ]
            }
          ]
        },
        {
          "title": "Limitations",
          "block-id": "1743123208",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743123215",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123209",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Studies 1 and 2 showed that providing scaffolding in an LLM-based editing interface has many benefits over a standard conversational interface."
                },
                {
                  "block-id": "1743123210",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "However, there are some potential limitations to the breadth of the applicability of these results."
                },
                {
                  "block-id": "1743123211",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The participant population consisted mainly of US-based English-speaking knowledge workers; the results found here might not transfer to other populations."
                },
                {
                  "block-id": "1743123212",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The studies were of short duration, whereas longitudinal studies that show changes in use over time can reveal different usages over time."
                },
                {
                  "block-id": "1743123213",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The evaluations assessed only short (100-400 word) documents, both to reduce the duration of study sessions and to avoid LLM latency issues."
                },
                {
                  "block-id": "1743123214",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Assessing on longer documents might reveal new insights."
                }
              ]
            },
            {
              "block-id": "1743123221",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123216",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Although InkSync works with any LLM (i.e., components in InkSync that interface do not require a particular LLM to function), we only experimented with OpenAI's GPT-4 model to conduct the usability studies."
                },
                {
                  "block-id": "1743123217",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We selected GPT-4 as it was a top-performing language model at the time of our studies, indicated by high performance on common benchmarks such as MMLU ."
                },
                {
                  "block-id": "1743123218",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "High-quality model outputs are essential to evaluating the usability of the system, as prior work has often found that low-quality system suggestions lead to degraded participant activity ."
                },
                {
                  "block-id": "1743123219",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Yet relying on GPT-4 -- a closed source model accessible only through API -- is limiting: OpenAI continuously updates the model served as GPT-4, hampers our findings' reproducibility and the lack of details on the training of GPT-4 prevents the community from building knowledge on the model's limitations."
                },
                {
                  "block-id": "1743123220",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Future work can integrate other closed and open-source LLMs into InkSync, and measure the underlying model's effect on the user's interaction."
                }
              ]
            }
          ]
        },
        {
          "title": "Future Directions",
          "block-id": "1743123222",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743123224",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123223",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "This work can be expanded in several directions:"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "title": "Conclusion",
      "block-id": "1743123225",
      "summary": "",
      "intent": "",
      "type": "section",
      "content": [
        {
          "block-id": "1743123231",
          "summary": "",
          "intent": "",
          "type": "paragraph",
          "content": [
            {
              "block-id": "1743123226",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "In this work, we presented InkSync, a text editing interface with LLM-based components that can suggest transparent and executable edits to human authors as they write."
            },
            {
              "block-id": "1743123227",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "InkSync also implements a three-stage information verification framework -- Warn, Verify, Audit -- to warn authors about possible factual errors, verify edits, and track content origin in the final document, simplifying the process of reviewing the accuracy of auto-generated passages."
            },
            {
              "block-id": "1743123228",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "A first usability study revealed that the complete interface which includes four edit-suggesting components improves the efficiency and effectiveness of participants at editing emails over baselines such as manual editing, or single-component interfaces."
            },
            {
              "block-id": "1743123229",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "In a second study, we confirm the effectiveness of the verification framework, finding that it helps participants detect and avoid three times as many factual inaccuracies compared to an interface without the framework implemented."
            },
            {
              "block-id": "1743123230",
              "summary": "",
              "intent": "",
              "type": "sentence",
              "content": "We hope that InkSync and the empirical insights from our two usability studies can inspire future research and products into writing tools that offer advanced LLM interaction while providing the tools for authors to ensure content accuracy and mitigate the propagation of misinformation."
            }
          ]
        }
      ]
    },
    {
      "title": "Appendix",
      "block-id": "1743123232",
      "summary": "",
      "intent": "",
      "type": "section",
      "content": [
        {
          "title": "LLM Prompt for Chat Component",
          "block-id": "1743123233",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743123237",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123234",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Figure~ details the prompt used to operate the Chat component (Section~)."
                },
                {
                  "block-id": "1743123235",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The complete prompt is composed by inserting the three examples of expected output into the  slot of the prompt guideline, the latest version of the document in the  slot, and the conversation containing author queries and system replies in  slot."
                },
                {
                  "block-id": "1743123236",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The listed output guidelines provide the Design Choices to the LLM as well as additional formatting information which was added iteratively to minimize system errors (e.g., your answer must start with )."
                }
              ]
            }
          ]
        },
        {
          "title": "Character-Level Provenance Tracing Algorithm",
          "block-id": "1743123238",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743123240",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123239",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In order to provide precise content provenance in the Audit interface, we implement a character-level tracing algorithm for any system-generated content that is accepted by the author during the editing process."
                }
              ]
            },
            {
              "block-id": "1743123245",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123241",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "First, note that the acceptance of an edit during the editing process does not guarantee that the edit will be present in the final version of the document."
                },
                {
                  "block-id": "1743123242",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In a subsequent action, the user might remove the edit partially or entirely, or the edit's content might not remain contiguous (e.g."
                },
                {
                  "block-id": "1743123243",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "if the user adds some text in the middle of the edited text)."
                },
                {
                  "block-id": "1743123244",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Accurate content provenance tracing therefore requires implementing a character-level algorithm to track system-generated content through the editing process."
                }
              ]
            },
            {
              "block-id": "1743123249",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123246",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In our implementation, manually typed characters are marked as user-originated, and any time a system suggestion is accepted into the draft, all characters inserted into the document based on this suggestion are marked as system-originated, and linked to the specific edit."
                },
                {
                  "block-id": "1743123247",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The state of the document is saved periodically as the user edits the document."
                },
                {
                  "block-id": "1743123248",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Each time the document is saved, we use the character-level Levenshtein string alignment algorithm  to track the movement of each system-generated character and record its new position in the latest document version."
                }
              ]
            },
            {
              "block-id": "1743123251",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123250",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Once an auditor requests to view the content provenance of a document, character-level tracing information is aggregated into contiguous spans and mapped back to originally accepted edits."
                }
              ]
            }
          ]
        },
        {
          "title": "Study Task: Email Customization Options",
          "block-id": "1743123252",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743123255",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123253",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Participants in both usability studies were tasked with editing email templates for the fictional InkSync travel agency."
                },
                {
                  "block-id": "1743123254",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "To make the task more specific, participants were provided with a target destination, and a customer persona, randomly selected (without replacement when participants completed multiple editing tasks) from pre-selected options."
                }
              ]
            },
            {
              "block-id": "1743123258",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123256",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "For Study 1, the five target destinations were: Paris, New York, Argentina, Singapore, and Egypt."
                },
                {
                  "block-id": "1743123257",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The four customer personas were: a business traveler who loves good food, a student on a budget, a parent with two 6-10-year-old children, and a retired person with limited mobility."
                }
              ]
            },
            {
              "block-id": "1743123260",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123259",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Since participants completed three editing tasks in Study 1, we ensured that each participant saw a new target destination and persona for each task."
                }
              ]
            },
            {
              "block-id": "1743123264",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123261",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "For Study 2, there were two editing tasks (Task 1 and 2), and we selected three new target destinations: Madagascar, Malaysia, and Jordan."
                },
                {
                  "block-id": "1743123262",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Note that for this second study, we purposefully selected destinations that are less well-known to participants living in Western countries, to ensure that participants would rely on the system recommendations to customize emails, rather than their own knowledge of the target destination."
                },
                {
                  "block-id": "1743123263",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Regarding the customer personas in Study 2, we selected the same four personas as in Study 1."
                }
              ]
            },
            {
              "block-id": "1743123267",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123265",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Below, we provide a concrete example of the shortest initial email template that participants edited during editing tasks."
                },
                {
                  "block-id": "1743123266",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We note that this example is the shortest initial prompt, the other templates are not included in the Appendix for brevity considerations but are available in the open-source repository."
                }
              ]
            },
            {
              "block-id": "1743123269",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123268",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Subject: Plan your next vacation.\\\\"
                }
              ]
            },
            {
              "block-id": "1743123273",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123270",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "How have you been?"
                },
                {
                  "block-id": "1743123271",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Are you tired and wanna go on a vacation?"
                },
                {
                  "block-id": "1743123272",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "I have special invitation to , here are the details.\\\\"
                }
              ]
            },
            {
              "block-id": "1743123275",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123274",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Experience vibrant cultur and explore the stunning landscapes the place has to offer.\\\\"
                }
              ]
            },
            {
              "block-id": "1743123279",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123276",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Dont miss out on this fantastc opportunity!"
                },
                {
                  "block-id": "1743123277",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Reach out to us now to book your escape."
                },
                {
                  "block-id": "1743123278",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Your dream vacation awaits!\\\\"
                }
              ]
            },
            {
              "block-id": "1743123281",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123280",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "InkSync Agency"
                }
              ]
            }
          ]
        },
        {
          "title": "Study 1: Quality Control",
          "block-id": "1743123282",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743123284",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123283",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Since participants completed  Study 1 unmoderated, we implemented additional controls in the interface to help ensure the validity of the findings."
                }
              ]
            },
            {
              "block-id": "1743123286",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123285",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "First, we disabled pasting of more than 50 characters into the text editor, to discourage participants from copying large amounts of text from an external source (e.g., Google search, an external LLM interface, etc.)."
                }
              ]
            },
            {
              "block-id": "1743123289",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123287",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Second, participants were instructed to complete the study on a laptop or desktop, and the interface displayed an error message if the window size was below the size of a 13'' screen at standard resolution."
                },
                {
                  "block-id": "1743123288",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Third, the interface was simplified: we removed the document list panel and used the space gained to provide study-related information such as the target destination, target persona, and a link to access the introductory material if needed."
                }
              ]
            },
            {
              "block-id": "1743123291",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123290",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Third, we added code to our interface disabling browser extensions such as Grammarly, to ensure participants solely relied on the tools provided in the study condition, rather than support tools available by default in their browser."
                }
              ]
            },
            {
              "block-id": "1743123294",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123292",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Fourth, participants were instructed to complete the editing task in 5 minutes and were warned within the interface once the allotted time had elapsed, but participants were allowed to continue editing to reach a desired milestone prior to moving on to the next task."
                },
                {
                  "block-id": "1743123293",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We verified that less than 10\\% of participants spent more than 6 minutes completing a task, ensuring fair comparison across interface conditions."
                }
              ]
            }
          ]
        },
        {
          "title": "Study 1: Example Edited Email",
          "block-id": "1743123295",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743123299",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123296",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Figure~ provides a concrete example of the editing outcome of a participant from Study 1."
                },
                {
                  "block-id": "1743123297",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "For this task, the participant was in the 4-Comp condition and had access to the four edit-suggesting components of InkSync."
                },
                {
                  "block-id": "1743123298",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The participant manually edited portions of the email (shown in grey), and used each of the four components for other edits, which are shown through color-coding."
                }
              ]
            },
            {
              "block-id": "1743123301",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123300",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The Markers and Brainstorm components were mostly used by the participant to improve language and remove grammatical errors, while the Chat and Comment features were used to expand on paragraphs, customizing the email with information specific about Egypt (the target destination), and the persona (a parent with two children aged 6-10)."
                }
              ]
            }
          ]
        },
        {
          "title": "Study 1: Annotation Detail",
          "block-id": "1743123302",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743123307",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123303",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In order to understand participant interaction, we performed several annotations on data collected in Study 1."
                },
                {
                  "block-id": "1743123304",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Due to the large number of emails edited by participants (around two hundred), we implemented a two-stage annotation procedure."
                },
                {
                  "block-id": "1743123305",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We first wrote detailed few-shot prompts for the annotation and prompted GPT-4 to obtain initial labels for the analysis."
                },
                {
                  "block-id": "1743123306",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We then manually reviewed all labels, and updated labels when required to ensure the high quality of the annotations."
                }
              ]
            },
            {
              "block-id": "1743123310",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123308",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Although the addition of GPT-4 to the assessment process introduces some level of error, we expect the error to be consistent across all interface conditions, and therefore not affect the relative differences in the comparison across conditions."
                },
                {
                  "block-id": "1743123309",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We will release all prompts used for annotation with the release of the data, to facilitate reproducibility."
                }
              ]
            }
          ]
        },
        {
          "title": "Study 1: Chat vs. Comment Conversations",
          "block-id": "1743123311",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743123316",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123312",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The Chat and Comment components of InkSync each provide a conversational interface to the participant."
                },
                {
                  "block-id": "1743123313",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Table~ summarizes an analysis of the properties of conversations that occur in the Chat and Comment components."
                },
                {
                  "block-id": "1743123314",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The analysis is based on all the interaction logs of participants in Study 1 and is based on 60 Chat conversations and 97 Comment conversations."
                },
                {
                  "block-id": "1743123315",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "(we did not include the conversations from the baseline  condition.)"
                }
              ]
            },
            {
              "block-id": "1743123320",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123317",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "First, Chat conversations tend to be much longer -- 8.6 messages exchanged -- compared to Comment conversations -- 3.0 messages exchanged."
                },
                {
                  "block-id": "1743123318",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We manually classify participants' messages into three classes: Edit Request (e.g., ``suggest what to eat in Egypt''), Information Seeking (e.g., ``what is the capital of Argentina''), and Chit-Chat (e.g., ``hi'', ``thanks'')."
                },
                {
                  "block-id": "1743123319",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "All three classes occur roughly equally in Chat conversations, whereas participant messages in Comment conversations are much more likely to be Edit Requests."
                }
              ]
            },
            {
              "block-id": "1743123324",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123321",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "For participant messages that were labeled as Edit Request, we further labeled whether the scope of the requested edit is local in which editing would only be required in a subpart of the document (i.e., ``add a sentence about food''), or global (e.g., ``fix all the typos in the document'')."
                },
                {
                  "block-id": "1743123322",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Unsurprisingly, edit requests in Comment conversations are very likely to have a local scope (80\\%)."
                },
                {
                  "block-id": "1743123323",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The scope is almost evenly split in Chat conversations, indicating that participants use the Chat component to request edits that are both local and global in scope."
                }
              ]
            },
            {
              "block-id": "1743123327",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123325",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "For participant messages that requested an edit, we also labeled whether the request explicitly specifies the desired location for the edit (Explicit Localization: ``Add a sentence about food in the first paragraph.'') or not (No Localization: ``Can you add some more ideas for activities for kids in Singapore'')."
                },
                {
                  "block-id": "1743123326",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In both conditions, participants predominantly did not specify localization, with only around 13\\% of user messages providing an explicit location for the desired edit."
                }
              ]
            },
            {
              "block-id": "1743123329",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123328",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The combination of the last two statistics suggests that in Chat conversations, participants frequently requested local edits without providing explicit localization."
                }
              ]
            },
            {
              "block-id": "1743123335",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123330",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "This section so far has described participant messages in the Chat and Comment conversation panes."
                },
                {
                  "block-id": "1743123331",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Regarding the components' responses, we analyze the number of suggested edits averaged across all participants, grouping them by No Suggestion (0), Single-Suggestion (1), and Multi-Suggestion (2+) responses."
                },
                {
                  "block-id": "1743123332",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "No suggestions can occur for information-seeking messages, for instance."
                },
                {
                  "block-id": "1743123333",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In the Chat component, the chat is almost equally likely to reply with no suggestions, with one or multiple suggestions."
                },
                {
                  "block-id": "1743123334",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "On the other hand, system replies to Comment requests are much more likely to suggest a single edit."
                }
              ]
            },
            {
              "block-id": "1743123340",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123336",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In summary, although both the Chat and Comment components offer a similar conversational interface to the user, we observe important differences in conversations that occur in each component."
                },
                {
                  "block-id": "1743123337",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Chat conversations are longer, with more diverse participant intent, where they request edits of both local and global scope while not usually specifying location explicitly."
                },
                {
                  "block-id": "1743123338",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "This causes the system to have to implicitly resolve ambiguity and produce wider variability in the number of suggested edits."
                },
                {
                  "block-id": "1743123339",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "By contrast, Comment conversations are shorter, with participants predominantly requesting editing of local scope, and the system frequently suggests a single edit in response, representing a much more focused and efficient localized conversation."
                }
              ]
            }
          ]
        },
        {
          "title": "Study 1: Factual Accuracy Annotation",
          "block-id": "1743123341",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743123344",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123342",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Similar to the analysis we performed for the Objective A/B calculations, we used a two-stage approach to identify the factual errors in the document."
                },
                {
                  "block-id": "1743123343",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In the first stage, we prompted GPT-4 to generate a list of factual errors in each of the edited emails, a list we reviewed and updated in the second manual stage."
                }
              ]
            },
            {
              "block-id": "1743123346",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123345",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We note that for this annotation, GPT-4 tended to produce a large number of false positives, with only one in five initially detected errors being confirmed manually as an error, indicative of the difficulty of factual inaccuracy detection for LLMs."
                }
              ]
            },
            {
              "block-id": "1743123350",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123347",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "False negatives are also a potential issue: since we only reviewed potential errors from the list generated by GPT-4, our annotation does not contain any error not originally listed by GPT-4."
                },
                {
                  "block-id": "1743123348",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We therefore encourage the reader to see our analysis as a lower bound on the number of errors present in the emails, with additional unidentified errors possibly present."
                },
                {
                  "block-id": "1743123349",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Since we used the same annotation procedure for all conditions, we expect the number of unidentified errors to be similar across conditions, and therefore not affect relative comparisons."
                }
              ]
            },
            {
              "block-id": "1743123355",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123351",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Table~ lists an identified example of each error category and severity, and Table~ summarizes the results of the annotation, broken down by interface conditions."
                },
                {
                  "block-id": "1743123352",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Across conditions, 28\\% of documents contain a minor factual error, and 12\\% contain a major error."
                },
                {
                  "block-id": "1743123353",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Major errors vary slightly based on the condition: 14.8\\% of documents edited in a condition with a conversational interface (NoEx Chat, Localized, Chat, or 4-Comp) contain a major error, compared to 6\\% for non-conversational interfaces (Manual, Markers)."
                },
                {
                  "block-id": "1743123354",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "We therefore find evidence that recommendations made by the system in conditions with conversational components lead to a higher likelihood of the participant integrating a major factual error in the email."
                }
              ]
            }
          ]
        },
        {
          "title": "Study 1: Component Response Time Analysis",
          "block-id": "1743123356",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743123360",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123357",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In Table~, we report on the average response time of the four LLM-based edit-suggesting components of InkSync."
                },
                {
                  "block-id": "1743123358",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The Chat, Comment, and Brainstorm components typically respond to author queries in 6-8 seconds, while the Markers component responds in 16 seconds."
                },
                {
                  "block-id": "1743123359",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The slower nature of the Markers components is less problematic, as the component predominantly runs in the background, and suggests edits to the user proactively."
                }
              ]
            },
            {
              "block-id": "1743123362",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123361",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "The development of LLMs is an active area of research, and we expect that LLMs with equal capabilities of GPT-4 but of smaller size will lead to lower response time, which will reduce component latency without lowering the quality of suggested edits."
                }
              ]
            }
          ]
        },
        {
          "title": "Study 2: Example System-Generated Inaccuracies",
          "block-id": "1743123363",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743123366",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123364",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In Study 2, we implement a perturbed prompt for the Chat component, that encourages the LLM to suggest factually inaccurate information in the edit suggestions."
                },
                {
                  "block-id": "1743123365",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Figure~ lists an example of an inaccurate suggestion made by the Chat component under the perturbed prompt to participants in Study 2, for each of the three destinations in the study."
                }
              ]
            },
            {
              "block-id": "1743123368",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123367",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "As designed, the recommendations include accuracies that could be verified through a Google search (e.g., where is Nasi Goreng from?), while not necessarily obvious to a US-based knowledge worked (e.g., claiming that Sushi was invented in New York)."
                }
              ]
            }
          ]
        },
        {
          "title": "Statistical Significance Analysis of Main Findings",
          "block-id": "1743123369",
          "summary": "",
          "intent": "",
          "type": "subsection",
          "content": [
            {
              "block-id": "1743123372",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123370",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "In order to establish the statistical significance of the findings of the usability studies (Section~-), we perform statistical tests with the entire participant population, as well as bootstrap re-sampling  (varying the number of participants through sub-sampling) to determine the minimum number of participants required to achieve statistical significance ($p < 0.05$)."
                },
                {
                  "block-id": "1743123371",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "When performing multiple comparisons relying on the same data, we use the Bonferroni correction  to adjust the significance level accordingly."
                }
              ]
            },
            {
              "block-id": "1743123375",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123373",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Figure~ presents the results of the four sets of statistical tests we performed."
                },
                {
                  "block-id": "1743123374",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "(Note that results from multiple studies are placed within individual charts to save space and facilitate comparison; however, each plot is independent of the other and could in principle appear in its own chart.)"
                }
              ]
            },
            {
              "block-id": "1743123377",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123376",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Figure~ includes four analyses: (1) Experiment 1: whether the inclusion of the Marker component leads to an improvement in Objective A (significant with 8 participants or more), (2) Experiment 2: whether any executable edit component leads to improvements over the manual interface (not statistically significant), (3) Experiment 3: whether the inclusion of a conversational component (Chat or Comment) leads to an improvement in Objective B (significant with 16 participants or more), (4) Experiment 4: Comparing the NoEx Chat and Chat conditions, whether there is a statistical significant improvement on both scores (not significant)."
                }
              ]
            },
            {
              "block-id": "1743123379",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123378",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Figure~ includes three analyses: (1) Experiment 1: whether the NoEx Chat condition leads to the least amount of editing in the five-minute editing sessions (significant starting with 50 participants), (2) Experiment 2: whether the conditions without executable edits (Manual, NoEx Chat) lead to slower editing than conditions with executable edits (Markers, Chat, Comment, 4-Comp), which is significant with 45 participants or more, and (3) Experiment 3: whether the 4-comp condition leads to faster editing than the single-component conditions (Markers, Chat, Comment), which is significant with 45 participants or more."
                }
              ]
            },
            {
              "block-id": "1743123381",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123380",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Figure~ includes two analyses: (1) Experiment 1: whether the Manual interface received the lowest ranking in terms of participant preferences (significant with 42 participants or more), and (2) Experiment 2: whether the 4-Comp condition was most favored by participants (not significant, with 65 participants $p=0.079$."
                }
              ]
            },
            {
              "block-id": "1743123384",
              "summary": "",
              "intent": "",
              "type": "paragraph",
              "content": [
                {
                  "block-id": "1743123382",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Figure~ includes two analyses based on Study 2: (1) Experiment 1: whether the inclusion of the Warn and Verify components leads to a larger proportion of avoided factual errors (Step 1 vs."
                },
                {
                  "block-id": "1743123383",
                  "summary": "",
                  "intent": "",
                  "type": "sentence",
                  "content": "Step 2), which is significant with 28 participants or more, (2) Experiment 2:  whether performing an audit leads to additional error reduction, compared to edit-time-only verification (which is significant with 17 participants or more)."
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "createdAt": "2025-03-28T00:44:30.127Z",
  "updatedAt": "2025-03-28T00:44:30.127Z",
  "version": 1
}